chat_system_588305036_actor_description=Elerio Shivarius. Archivist of the magic school.
chat_system_588305036_snap_0_question=^?^Good day, young man. I hope you have good reason to distract me from my work...
chat_system_588305036_snap_0_answer_0=^?^I came at a Zombie's request...
chat_system_588305036_snap_0_answer_1=^?^I've brought you the cursed ring!
chat_system_588305036_snap_0_answer_2=^?^I've dealt with the cursed ring, as you requested.
chat_system_588305036_snap_1_question=^?^Zombie? What's this!? I once heard of a man like you who thought he could speak with the dead, but not being a mage he first had to prepare himself by drinking a couple jugs of wine!<br>You don't seem like a man trained to commune with corpses...
chat_system_588305036_snap_1_answer_0=^?^The miller from the village has turned into a zombie. I talked to him and he sent me to you for advice...
chat_system_588305036_snap_7_question=^?^Interesting! By this account, the miller had gone through a sort-of partial transformation into an undead creature, but still preserves some part of his living senses! This is a rare thing indeed, but it's not impossible.
chat_system_588305036_snap_7_answer_0=^?^And what could have caused it?
chat_system_588305036_snap_2_question=^?^Usually this happens as a result of a curse, probably by wearing some cursed item. The curse gradually blackens the soul of its owner and deadens his flesh... Yes, it must have happened like this.<br>If you brought me the cursed item, I would be able to analyze the structure of the curse, and perhaps create a counter-spell...
chat_system_588305036_snap_2_answer_0=^?^The cursed item? Ok, I'll ask the miller if he's come across any strange items.
chat_system_588305036_snap_3_question=^?^How interesting... No-no! I guess I won't take it in my hands now. The curse is rather strong, and I wouldn't like to take the risk. By the way, are you alright? You don't feel giddy? Your feet growing numb?
chat_system_588305036_snap_3_answer_0=^?^But what's this have to do with removing the curse?
chat_system_588305036_snap_5_question=^?^I'm sorry, never mind, just my curiosity...<br>I beg your pardon, but I can't help you under the circumstances. This is no common object, but a highly animate one. And at this moment, the Ring's Keepers are in quite an aggressive mood. They won't even let me approach close enough to examine the magic structure of the ring, not to mention break the charm.<br>I'm afraid you'll have to eliminate them, young man!
chat_system_588305036_snap_5_answer_0=^?^Ok, I'll suppress the cursed ring!
chat_system_588305036_snap_5_answer_1=^?^The Keepers? What do you mean?
chat_system_588305036_snap_6_question=^?^Strange, haven't you been told in the Magic Academy about enchanted items that bear souls?<br>Anyway, in short: some enchanted items obtain their properties due to the soul imparted to them by their creators. We call such artifacts "animate." And sometimes they act in a very willful way. The most effective method to clamp a rebelling item is to suppress it. In order to gain control of the thing, one needs to "enter into" the item and win a battle with its Keepers.
chat_system_588305036_snap_6_answer_0=^?^Thank you. So, I'll kill the Ring's Keepers, then return to you.
chat_system_588305036_snap_4_question=^?^Excellent! Now I'll be able to examine the structure of the curse and make up a counter-spell. Actually, it's a fairly elementary task... now to modify the structure a little and...<br>[s]While talking to you Shivarius strangely manipulates the ring, which for a moment throws off blue sparks as it glitters a reddish color... [/s]<br>All ready! Ah, and the spell that will take off the miller's curse sounds like this: "Sobius rat caberian torus!"<br>As for the ring, I'll have it melted down so that it won't kill any more poor souls.
chat_system_588305036_snap_4_answer_0=^?^ Sobius rat... Yes, got it. Thank you kindly!
